practice_023_leetcode_weekly_contest_302.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Practice #023: Leetcode - Weekly Contest 302</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">

</head>
<body>
<!--  --><nav><span class="nav-header">Problem Solving</span><span class="nav-items"><a href="index.html">Home</a><span></nav><div id="content" class="content">
<h1 class="title">Practice #023: Leetcode - Weekly Contest 302</h1>

<div id="outline-container-orgab80549" class="outline-2">
<h2 id="orgab80549">Leetcode: 2341. Maximum Number of Pairs in Array</h2>
<div class="outline-text-2" id="text-orgab80549">
<p>
<a href="https://leetcode.com/problems/maximum-number-of-pairs-in-array/">Problem Statement</a>
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> typing <span style="font-weight: bold;">import</span> List


<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">numberOfPairs</span>(<span style="font-weight: bold;">self</span>, nums: List[<span style="font-weight: bold;">int</span>]) -&gt; <span style="font-weight: bold; font-style: italic;">List</span>[<span style="font-weight: bold;">int</span>]:
        freq = {}
        <span style="font-weight: bold;">for</span> n <span style="font-weight: bold;">in</span> <span style="font-weight: bold; font-style: italic;">nums</span>:
            freq.setdefault(n, 0)
            freq[<span style="font-weight: bold; font-style: italic;">n</span>] += 1

        <span style="font-weight: bold; font-style: italic;">ans</span> = 0
        <span style="font-weight: bold; font-style: italic;">ext</span> = 0
        <span style="font-weight: bold;">for</span> x, v <span style="font-weight: bold;">in</span> freq.items():
            <span style="font-weight: bold; font-style: italic;">ans</span> += v // 2
            <span style="font-weight: bold; font-style: italic;">ext</span> += v % 2
        <span style="font-weight: bold;">return</span> [ans, ext]


<span style="font-weight: bold;">assert</span> Solution().numberOfPairs([1, 3, 2, 1, 3, 2, 2]) == [3, 1]
<span style="font-weight: bold;">assert</span> Solution().numberOfPairs([1, 1]) == [1, 0]
<span style="font-weight: bold;">assert</span> Solution().numberOfPairs([0]) == [0, 1]
</pre>
</div>
</div>
</div>

<div id="outline-container-org31f5ebb" class="outline-2">
<h2 id="org31f5ebb">Leetcode: 2342. Max Sum of a Pair With Equal Sum of Digits</h2>
<div class="outline-text-2" id="text-org31f5ebb">
<p>
<a href="https://leetcode.com/problems/max-sum-of-a-pair-with-equal-sum-of-digits/">Problem Statement</a>
</p>

<p>
<a href="can_we_simplify_the_problem_which_keeping_it_the_same.html#ID-F19C9539-EE46-41EE-8DEF-24C3076C6DC2">Can we simplify the problem while keeping it the same?</a>  We can group all numbers the sum of their digits, sort each group and compute the answer.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> typing <span style="font-weight: bold;">import</span> List


<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">maximumSum</span>(<span style="font-weight: bold;">self</span>, nums: List[<span style="font-weight: bold;">int</span>]) -&gt; <span style="font-weight: bold;">int</span>:
        g = {}
        <span style="font-weight: bold;">for</span> n <span style="font-weight: bold;">in</span> <span style="font-weight: bold; font-style: italic;">nums</span>:
            m = n
            <span style="font-weight: bold; font-style: italic;">s</span> = 0
            <span style="font-weight: bold;">while</span> n &gt; 0:
                <span style="font-weight: bold; font-style: italic;">s</span> += n % 10
                <span style="font-weight: bold; font-style: italic;">n</span> = n // 10
            g.setdefault(s, [])
            g[s].append(m)

        <span style="font-weight: bold; font-style: italic;">ans</span> = -1
        <span style="font-weight: bold;">for</span> n <span style="font-weight: bold;">in</span> g:
            g[n].sort()
            <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">len</span>(g[n]) &gt; 1:
                <span style="font-weight: bold; font-style: italic;">ans</span> = <span style="font-weight: bold;">max</span>(ans, g[n][-1] + g[n][-2])
        <span style="font-weight: bold;">return</span> ans


<span style="font-weight: bold;">assert</span> Solution().maximumSum([18, 43, 36, 13, 7]) == 54
<span style="font-weight: bold;">assert</span> Solution().maximumSum([10, 12, 19, 14]) == -1
</pre>
</div>
</div>
</div>

<div id="outline-container-orga13e16c" class="outline-2">
<h2 id="orga13e16c">Leetcode: 2343. Query Kth Smallest Trimmed Number</h2>
<div class="outline-text-2" id="text-orga13e16c">
<p>
<a href="https://leetcode.com/problems/query-kth-smallest-trimmed-number/">Problem Statement</a>
</p>

<p>
Slice and sort the numbers to solve the problem.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> typing <span style="font-weight: bold;">import</span> List


<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">smallestTrimmedNumbers</span>(
        <span style="font-weight: bold;">self</span>, nums: List[<span style="font-weight: bold;">str</span>], queries: List[List[<span style="font-weight: bold;">int</span>]]
    ) -&gt; <span style="font-weight: bold; font-style: italic;">List</span>[<span style="font-weight: bold;">int</span>]:
        ans = []
        <span style="font-weight: bold;">for</span> q <span style="font-weight: bold;">in</span> <span style="font-weight: bold; font-style: italic;">queries</span>:
            nnums = [(num[-q[1] :], i) <span style="font-weight: bold;">for</span> i, num <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">enumerate</span>(nums)]
            nnums.sort()
            ans.append(nnums[q[0] - 1][1])
        <span style="font-weight: bold;">return</span> ans


<span style="font-weight: bold;">assert</span> Solution().smallestTrimmedNumbers(
    [<span style="font-style: italic;">"102"</span>, <span style="font-style: italic;">"473"</span>, <span style="font-style: italic;">"251"</span>, <span style="font-style: italic;">"814"</span>], [[1, 1], [2, 3], [4, 2], [1, 2]]
) == [2, 2, 1, 0]
<span style="font-weight: bold;">assert</span> Solution().smallestTrimmedNumbers(
    [<span style="font-style: italic;">"24"</span>, <span style="font-style: italic;">"37"</span>, <span style="font-style: italic;">"96"</span>, <span style="font-style: italic;">"04"</span>], [[2, 1], [2, 2]]
) == [3, 0]
</pre>
</div>
</div>
</div>

<div id="outline-container-org9683ec8" class="outline-2">
<h2 id="org9683ec8">Leetcode: 2344. Minimum Deletions to Make Array Divisible</h2>
<div class="outline-text-2" id="text-org9683ec8">
<p>
<a href="https://leetcode.com/problems/minimum-deletions-to-make-array-divisible/">Problem Statement</a>
</p>

<p>
<a href="can_we_simplify_the_problem_which_keeping_it_the_same.html#ID-F19C9539-EE46-41EE-8DEF-24C3076C6DC2">Can we simplify the problem while keeping it the same?</a>  We don't need the array <code>numsDivide</code>, but only the greatest divisor \(g\) of all them.  After that, we have to check from the smaller to the greatest what number is divides \(g\).
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> typing <span style="font-weight: bold;">import</span> List


<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">minOperations</span>(<span style="font-weight: bold;">self</span>, nums: List[<span style="font-weight: bold;">int</span>], numsDivide: List[<span style="font-weight: bold;">int</span>]) -&gt; <span style="font-weight: bold;">int</span>:
        <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">gcd</span>(x, y):
            <span style="font-weight: bold;">while</span> y:
                <span style="font-weight: bold; font-style: italic;">x</span>, <span style="font-weight: bold; font-style: italic;">y</span> = y, x % y
            <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">abs</span>(x)

        <span style="font-weight: bold; font-style: italic;">g</span> = numsDivide[0]
        <span style="font-weight: bold;">for</span> n <span style="font-weight: bold;">in</span> <span style="font-weight: bold; font-style: italic;">numsDivide</span>[1:]:
            g = gcd(g, n)

        <span style="font-weight: bold; font-style: italic;">freq</span> = {}
        <span style="font-weight: bold;">for</span> n <span style="font-weight: bold;">in</span> <span style="font-weight: bold; font-style: italic;">nums</span>:
            freq.setdefault(n, 0)
            freq[<span style="font-weight: bold; font-style: italic;">n</span>] += 1

        <span style="font-weight: bold; font-style: italic;">ans</span> = 0
        <span style="font-weight: bold;">for</span> n, f <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">sorted</span>(freq.items()):
            <span style="font-weight: bold; font-style: italic;">c</span> = gcd(g, n)
            <span style="font-weight: bold;">if</span> c &lt; <span style="font-weight: bold; font-style: italic;">n</span>:
                ans += f
            <span style="font-weight: bold;">else</span>:
                <span style="font-weight: bold;">return</span> ans

        <span style="font-weight: bold;">return</span> -1


<span style="font-weight: bold;">assert</span> Solution().minOperations([2, 3, 2, 4, 3], [9, 6, 9, 3, 15]) == 2
<span style="font-weight: bold;">assert</span> Solution().minOperations([4, 3, 6], [8, 2, 6, 10]) == -1
</pre>
</div>
</div>
</div>
</div>
</body>
</html>